  [
  {
    "id": 0,
    "title": "Microsoft Protege Competition",
    "date": "2020",
    "description1": "Placed in top 16 nationwide by designing an innovative, technically and financially feasible solution to vastly improve the quality of emergency services personnel training",
    "description2": "This was a fantastic opportunity to challenge creativity and innovation through designing for real world problems. The theme was improving the preparation, management or recovery of a bushfire, an important topic.",
    "linkedin": "https://www.linkedin.com/feed/update/urn:li:activity:6662890881579917312/",
    "image": "http://emanouel.com.au/static/media/microsoft.4eff2a8e.png"
  },
  {
    "id": 1,
    "title": "Google Case Competition",
    "date": "2019",
    "description1": "Placed first out of all teams across four major universities through designing a chrome extension that will provide added assistance and a better experience for students with additional learning needs",
    "description2": "This competition required thinking outside of engineering alone and into the feasibility of that design. The business and finances aspect was heavily analysed to ensure a sustainable solution.",
    "linkedin": "https://www.linkedin.com/feed/update/urn:li:activity:6524618113437265920/",
    "image": "http://emanouel.com.au/static/media/googlecomp.24f8c688.jpeg"
  },
  {
    "id": 2,
    "title": "Software Developer @ UTS Motorsports Electric",
    "date": "2018-2019",
    "description1": "Integrated into the team as the sole software developer. Mainly focusing on designing and building a new website and a telemetry system to visualise the cars performance.",
    "description2": "Built upon the existing website through wordpress and updating articles and images to reflect the current team. Taking the time to ensure the theme was on brand and the detailing was correct was a positive learning experience. It branched upon existing skills to grow into a more dynamic and rounded engineer.",
    "image": "http://emanouel.com.au/static/media/motorsports2.880f1e63.webp"
  },
  {
    "id": 3,
    "title": "UTS Lucy mentoring program",
    "date": "2019",
    "description1": "Through the program, was partnered with an industry professional who mentored me formally over one year and informally since. ",
    "description2": "Being partnered with Beverly was an immense growth opportunity. She consistently challenged and taught me and imparted her invaluable knowledge about being both in the technology industry and a woman in this industry.   ",
    "linkedin": "https://www.linkedin.com/feed/update/urn:li:activity:6579857264344170496/",
    "image": "http://emanouel.com.au/static/media/lucy.9f37f8fe.jpeg"
  }
]
